app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."deleted_at" IS NULL
---
  def index
    @events = Event.all

INSERT INTO "events" ("artist", "description", "price_low", "price_high", "event_date", "created_at", "updated_at", "position") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

SELECT  "events".* FROM "events" WHERE "events"."deleted_at" IS NULL AND "events"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_event
      @event = Event.find(params[:id])